tap "homebrew/bundle"
tap "nikitabobko/tap"
brew "bat"
brew "cocoapods"
brew "colima"
brew "docker"
brew "docker-compose"
brew "docker-credential-helper"
brew "fzf"
brew "git"
brew "go"
brew "gradle"
brew "neovim"
brew "node"
brew "openjdk@17"
brew "powerlevel10k"
brew "ripgrep"
brew "sdl2"
brew "sdl2_image"
brew "sdl2_ttf"
brew "tlrc"
brew "tmux"
brew "tree"
brew "wget"
brew "zig"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
cask "aerospace"
cask "android-commandlinetools"
cask "android-platform-tools"
cask "flutter"
cask "iterm2"
cask "keycastr"
cask "wezterm"
