tap "daipeihust/tap"
tap "homebrew/bundle"
tap "laishulu/homebrew"
tap "nikitabobko/tap"
brew "act"
brew "bat"
brew "cocoapods"
brew "colima"
brew "docker"
brew "docker-compose"
brew "docker-credential-helper"
brew "fzf"
brew "git"
brew "go"
brew "golangci-lint"
brew "lazydocker"
brew "llvm"
brew "neovim"
brew "node"
brew "ripgrep"
brew "opencode"
brew "powerlevel10k"
brew "pre-commit"
brew "protobuf"
brew "protoc-gen-go"
brew "protoc-gen-go-grpc"
brew "rustup"
brew "sdl2"
brew "sdl2_image"
brew "sdl2_ttf"
brew "staticcheck"
brew "stow"
brew "tlrc"
brew "tmux"
brew "tree"
brew "wget"
brew "xcbeautify"
brew "xcode-build-server"
brew "xcp"
brew "zig"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "laishulu/homebrew/macism"
cask "nikitabobko/tap/aerospace"
cask "android-platform-tools"
cask "brave-browser"
cask "calibre"
cask "discord"
cask "flutter"
cask "ghostty"
cask "iterm2"
cask "keycastr"
cask "obs"
cask "sioyek"
cask "wezterm"
go "github.com/air-verse/air"
go "golang.org/x/tools/cmd/callgraph"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/davidrjenni/reftools/cmd/fillswitch"
go "github.com/onsi/ginkgo/v2/ginkgo"
go "github.com/abice/go-enum"
go "mvdan.cc/gofumpt"
go "golang.org/x/tools/cmd/goimports"
go "github.com/twpayne/go-jsonstruct/v3/cmd/gojsonstruct"
go "github.com/golangci/golangci-lint/v2/cmd/golangci-lint"
go "github.com/segmentio/golines"
go "github.com/fatih/gomodifytags"
go "github.com/abenz1267/gomvp"
go "golang.org/x/tools/cmd/gonew"
go "golang.org/x/tools/gopls"
go "golang.org/x/tools/cmd/gorename"
go "github.com/rakyll/gotest"
go "github.com/cweill/gotests/gotests"
go "gotest.tools/gotestsum"
go "golang.org/x/vuln/cmd/govulncheck"
go "github.com/koron/iferr"
go "github.com/josharian/impl"
go "github.com/tmc/json-to-struct"
go "go.uber.org/mock/mockgen"
go "github.com/kyoh86/richgo"
cargo "rustlings"
